const ru_RU = {
  title: 'Настройка уведомлений',
  webhooks: {
    help_content:
      'Механизм обратного вызова для интеграции Nightingale с другими системами. После создания события оповещения Nightingale, оно будет отправлено на каждый адрес обратного вызова. Вы можете разработать собственный HTTP API, настроить его здесь и получать события оповещений от Nightingale для автоматизации и выполнения пользовательских функций. Nightingale использует метод HTTP POST и отправляет содержимое события оповещения в формате JSON в тело HTTP-запроса. Структуру данных события можно найти [здесь](https://github.com/ccfos/nightingale/blob/main/models/alert_cur_event.go#L19). Вы можете найти машину с сетевым доступом к Nightingale (предположим, ее IP-адрес 10.1.2.3), запустить на ней порт с помощью nc, например, `nc -k -l 4321` для прослушивания порта 4321 с помощью nc, затем настроить `http://10.1.2.3:4321` как адрес обратного вызова, создать правило оповещения, и как только оно сработает, Nightingale вызовет этот адрес, и вы увидите подробный формат данных, отправленных обратным вызовом Nightingale, в выводе команды nc.',
    title: 'Адреса обратного вызова',
    enable: 'Включить',
    note: 'Примечание',
    url: 'URL',
    timeout: 'Тайм-аут (sec)',
    basic_auth_user: 'Имя пользователя (Basic Auth)',
    basic_auth_password: 'Пароль (Basic Auth)',
    skip_verify: 'Пропустить проверку SSL',
    add: 'Добавить',
    help: '\n      Если вы хотите пересылать все события оповещений Nightingale на другую платформу для обработки, вы можете использовать глобальный адрес обратного вызова здесь.\n      <br />\n      <br />\n      Обычно система мониторинга фокусируется на сборе данных, хранении, анализе и генерации событий оповещений. Для последующего распределения событий, шумоподавления, назначения, эскалации, составления расписаний и координации обычно используются отдельные продукты, известные как продукты для управления инцидентами (OnCall). Продукты OnCall широко используются в компаниях, практикующих принципы SRE.\n      <br />\n      <br />\n      Продукты OnCall обычно могут интегрироваться с различными системами мониторинга, такими как Prometheus, Nightingale, Zabbix, ElastAlert, Blueking, различные облачные системы мониторинга. Эти системы мониторинга отправляют события оповещений в центр OnCall через WebHook, где пользователи могут выполнять последующее распределение, шумоподавление и обработку.\n      <br />\n      <br />\n      Среди продуктов OnCall за рубежом лидирует <a1>PagerDuty</a1>, а в Китае - <a2>FlashDuty</a2>. Вы можете зарегистрироваться и попробовать их бесплатно.\n    ',
  },
  script: {
    title: 'Скрипт уведомлений',
    enable: 'Включить',
    timeout: 'Тайм-аут (sec)',
    type: ['Использовать скрипт', 'Использовать путь'],
    path: 'Путь к файлу',
    content: 'Скрипт',
  },
  channels: {
    title: 'Каналы уведомлений',
    name: 'Название',
    ident: 'Идентификатор',
    ident_msg1: 'Идентификатор может содержать только буквы, цифры, нижние подчеркивания и дефисы',
    ident_msg2: 'Идентификатор уже существует',
    hide: 'Скрыть',
    add: 'Добавить',
    add_title: 'Добавить канал уведомлений',
    edit_title: 'Редактировать канал уведомлений',
    enabled: 'Включено',
  },
  contacts: {
    title: 'Контакт',
    add_title: 'Добавить контакт',
    edit_title: 'Редактировать контакт',
  },
  smtp: {
    title: 'Настройки SMTP',
    testMessage: 'Тестовое сообщение отправлено, пожалуйста, проверьте почту',
  },
  ibex: {
    title: 'Настройка самовосстановления',
  },
};

export default ru_RU;
