const ru_RU = {
  title: 'Действующие оповещения',
  search_placeholder: 'Поиск по правилам и меткам (несколько ключевых слов через пробел)',
  hours: {
    '6': 'Последние 6 часов',
    '12': 'Последние 12 часов',
    '24': 'Последний 1 день',
    '48': 'Последние 2 дня',
    '72': 'Последние 3 дня',
    '168': 'Последние 7 дней',
    '336': 'Последние 14 дней',
    '720': 'Последние 30 дней',
    '1440': 'Последние 60 дней',
    '2160': 'Последние 90 дней',
  },
  severity: 'Уровень события',
  eventType: 'Тип события',
  event_name: 'Событие',
  first_trigger_time: 'Время первого срабатывания',
  trigger_time: 'Время срабатывания',
  shield: 'Заблокировать',
  prod: 'Тип мониторинга',
  duration: 'Продолжительность',
  aggregate_rule: 'Правило сбора',
  aggregate_rule_mgs: 'Выберите правило сбора',
  aggregate_rule_tip: `Агрегируйте и классифицируйте оповещения на основе атрибутов и тегов события для удобного просмотра. Используйте Go Template для ссылки на поля события, например:
  
- Агрегировать по бизнес-группе + уровню события: \`Group:{{.GroupName}} Severity:{{.Severity}}\`
- Агрегировать по заголовку правила оповещения: \`{{.RuleName}}\`
- Агрегировать по тегу экземпляра события: \`{{.TagsMap.instance}}\``,
  aggr_result: 'результатов сбора',
  aggregate_rule_name: 'Название правила',
  aggregate_rule_title: 'Название карточки сбора',
  add_rule: 'Добавить правило',
  public: 'Открытый',
  isPublic: 'Открытое',
  status: 'Признак принятия',
  status_1: 'Принято',
  status_0: 'Не принято',
  batch_btn: 'Пакетная операция',
  batch_claim: 'Пакетное принятие',
  batch_unclaim: 'Пакетное отмена принятия',
  claim: 'Принятие',
  unclaim: 'Отмена принятия',
  claimant: 'Лицо, принявшее решение',
  search: 'Поиск источника данных',
  delete_confirm: {
    title: 'Удалить событие предупреждения',
    content:
      'Обычно событие предупреждения удаляется только в том случае, если данные мониторинга больше не отправляются (например, изменено метка данных или машина выключена), так как событие предупреждения больше не может автоматически восстановиться. Вы уверены, что хотите это сделать?',
  },
  my_groups: 'Мои бизнес-группы',
  all_groups: 'Все бизнес-группы',
  datasources: 'Источники данных',
  detail_title: 'Детали события',
};

export default ru_RU;
