const ru_RU = {
  title: 'Подписки',
  search_placeholder: 'Поиск по названию подписки, правилам подписки, тегам подписки, группам получателей уведомлений',
  rule_name: 'Подписки',
  sub_rule_name: 'Правила оповещений для подписки',
  sub_rule_selected: 'Выбранные правила',
  tags: 'Теги подписки',
  user_groups: 'Группы получателей уведомлений',
  tag: {
    key: {
      label: 'Ключ тега события для подписки',
      tip: 'Здесь теги относятся к тегам событий оповещений, фильтрация оповещений происходит по правилам соответствия тегов',
      required: 'Ключ тега не может быть пустым',
      placeholder: 'Введите ключ тега',
    },
    func: {
      label: 'Оператор',
    },
    value: {
      label: 'Значение тега',
      equal_placeholder: 'Введите значение',
      include_placeholder: 'Можно ввести несколько значений, разделяя их клавишей Enter',
      regex_placeholder: 'Введите регулярное выражение для соответствия',
      required: 'Значение тега не может быть пустым',
    },
  },
  group: {
    key: {
      label: 'Бизнес-группа подписки',
      placeholder: 'Бизнес-группа',
    },
    func: {
      label: 'Оператор',
    },
    value: {
      label: 'Значение',
      required: 'Значение не может быть пустым',
    },
  },
  redefine_severity: 'Переопределить уровень оповещения',
  redefine_channels: 'Переопределить каналы уведомлений',
  redefine_webhooks: 'Переопределить вебхуки',
  user_group_ids: 'Группы получателей подписки',
  for_duration: 'Продолжительность события (в секундах)',
  for_duration_tip:
    'Пример: если настроено 300, то при первом получении события оповещения, оно не будет соответствовать подписке. Когда оно будет получено снова, система вычислит разницу между текущим временем срабатывания и временем первого срабатывания. Если эта разница превышает 300 секунд, событие будет соответствовать условиям подписки и выполнится соответствующая логика уведомления. Если меньше 300 секунд, события не будут соответствовать подписке. Эту функцию можно использовать для эскалации оповещений: руководитель команды может настроить подписку с длительностью более 1 часа (3600 секунд) и указать себя получателем, чтобы гарантировать, что оповещения всегда будут обработаны.',
  webhooks: 'Новые вебхуки',
  webhooks_msg: 'Вебхук не может быть пустым',
  prod: 'Тип мониторинга',
  subscribe_btn: 'Подписаться',
  basic_configs: 'Базовая конфигурация',
  severities: 'Уровень событий',
  severities_msg: 'Уровень событий не может быть пустым',
  tags_groups_require: 'Заполните хотя бы одно поле: теги или группы получателей',
  note: 'Название подписки',
  filter_configs: 'Настройки фильтрации',
  notify_configs: 'Настройки уведомлений',
  and: 'и',
};

export default ru_RU;
