const ja_JP = {
  append_tags_msg: 'タグ形式が正しくありません。確認してください！',
  append_tags_msg1: 'タグの長さは 64 ビット以下である必要があります',
  append_tags_msg2: 'タグ形式は key=value である必要があります。key は文字またはアンダースコアで始まり、文字、数字、アンダースコアで構成されています。',
  append_tags_placeholder: 'タグ形式は key=value です。Enter キーまたはスペースで区切ります',
  tag: {
    key: {
      label: 'タグキー',
      msg: 'タグキーは必須です',
    },
    func: {
      label: '演算子',
      label_tip: `複数のマッチング演算子をサポートしています。以下に説明します：
- \`==\` 特定のタグ値にマッチします。1つの値のみ入力可能です。複数の値を同時にマッチさせたい場合は \`in\` 演算子を使用してください
- \`=~\` 正規表現を入力して、タグ値を柔軟にマッチさせます
- \`in\` 複数のタグ値にマッチします。SQL の \`in\` 操作に似ています
- \`not in\` マッチしないタグ値を指定します。複数の値を入力可能で、SQL の \`not in\` 操作に似ており、複数のタグ値を除外するために使用されます
- \`!=\` 等しくない。特定のタグ値を除外するために使用されます
- \`!~\` 正規表現の不一致。正規表現を入力し、この正規表現にマッチするタグ値はすべて除外されます。PromQL の \`!~\` に似ています`,
      msg: '演算子は必須です',
    },
    value: {
      label: 'タグ値',
      placeholder1: '複数の値を入力できます。改行で区切ります',
      placeholder2: '正規表現を入力してください',
      msg: 'タグ値は必須です',
    },
    add: 'タグを追加',
  },
};

export default ja_JP;
