const ru_RU = {
  append_tags_msg: 'Неверный формат тегов, пожалуйста, проверьте!',
  append_tags_msg1: 'Длина тега должна быть не более 64 символов',
  append_tags_msg2: 'Формат тега должен быть key=value. key должен начинаться с буквы или подчеркивания и состоять из букв, цифр и подчеркиваний. ',
  append_tags_placeholder: 'Формат тега key=value, используйте Enter или пробел для разделения',
  tag: {
    key: {
      label: 'Ключ тега',
      msg: 'Ключ тега не может быть пустым',
    },
    func: {
      label: 'Оператор',
      msg: 'Оператор не может быть пустым',
    },
    value: {
      label: 'Значение тега',
      placeholder1: 'Можно ввести несколько значений, разделяя их клавишей Enter',
      placeholder2: 'Пожалуйста, введите регулярное выражение',
      msg: 'Значение тега не может быть пустым',
    },
    add: 'Добавить тег',
  },
};

export default ru_RU;
