const ru_RU = {
  append_tags_msg: 'Неверный формат тегов, пожалуйста, проверьте!',
  append_tags_msg1: 'Длина тега должна быть не более 64 символов',
  append_tags_msg2: 'Формат тега должен быть key=value. key должен начинаться с буквы или подчеркивания и состоять из букв, цифр и подчеркиваний. ',
  append_tags_placeholder: 'Формат тега key=value, используйте Enter или пробел для разделения',
  tag: {
    key: {
      label: 'Ключ тега',
      msg: 'Ключ тега не может быть пустым',
      duplicate_error: 'Не допускается использование одинаковых ключей, это может привести к тому, что события не будут сопоставлены',
      placeholder: 'Введите или выберите ключ тега для сопоставления, например, app / cluster / alertname',
    },
    func: {
      label: 'Оператор',
      label_tip: `Поддерживает несколько операторов сопоставления, описание следующее:
- \`==\` Соответствует определенному значению тега, можно указать только одно значение. Если вы хотите сопоставить несколько значений одновременно, используйте оператор \`in\`
- \`=~\` Введите регулярное выражение для гибкого сопоставления значений тегов
- \`in\` Соответствует нескольким значениям тегов, аналогично операции \`in\` в SQL
- \`not in\` Исключает значения тегов, можно указать несколько значений, аналогично операции \`not in\` в SQL, используется для исключения нескольких значений тегов
- \`!=\` Не равно, используется для исключения определенного значения тега
- \`!~\` Регулярное выражение не соответствует, введите регулярное выражение, все значения тегов, соответствующие этому регулярному выражению, будут исключены, аналогично \`!~\` в PromQL`,
      msg: 'Оператор не может быть пустым',
    },
    value: {
      label: 'Значение тега',
      placeholder: 'Введите или выберите значение тега для сопоставления',
      msg: 'Значение тега не может быть пустым',
    },
    add: 'Добавить тег',
  },
  attr: {
    key: {
      label: 'Имя атрибута',
      msg: 'Имя атрибута обязательно',
      duplicate_error: 'Имена атрибутов должны быть уникальными',
    },
  },
};

export default ru_RU;
