const ru_RU = {
  title: 'Управление источниками данных',
  search_placeholder: 'Пожалуйста, введите ключевое слово для поиска',
  chooseDataSourceType: 'Выберите тип источника данных',
  name: 'Название источника данных',
  id: 'Идентификатор источника данных',
  description: 'Примечание',
  type: 'Тип источника данных',
  enable: 'Включить',
  disable: 'Отключить',
  confirm: {
    enable: 'Вы уверены, что хотите включить этот источник данных?',
    disable: 'Вы уверены, что хотите отключить этот источник данных?',
  },
  success: {
    enable: 'Успешно включено',
    disable: 'Успешно отключено',
  },
  add_title: 'Создать источник данных',
  edit_title: 'Изменить источник данных',
  rename_title: 'Изменить название источника данных',
  type_btn_add: 'Добавить',
  default: 'Установить по умолчанию',
  default_msg: 'Тип источника данных по умолчанию, данные, собранные функцией сетевого сканирования, будут отправлены в этот источник данных',
  default_tip: 'Тип источника данных по умолчанию, данные, собранные функцией сетевого сканирования, будут отправлены в этот источник данных',
  auth: {
    name: 'Авторизация',
    'not-support': 'Не поддерживается',
  },
  status: {
    title: 'Статус',
    enabled: 'Включено',
    disabled: 'Отключено',
  },
  form: {
    other: 'Другое',
    name: 'Название',
    name_msg: 'Пожалуйста, введите буквы/цифры/подчеркивания, должно начинаться с буквы',
    name_msg2: 'Не менее трех символов',
    identifier: 'Идентификатор источника данных',
    timeout: 'Тайм-аут (мс)',
    auth: 'Авторизация',
    username: 'Имя пользователя',
    password: 'Пароль',
    skip_ssl_verify: 'Пропустить проверку SSL',
    yes: 'Да',
    no: 'Нет',
    headers: 'Пользовательские HTTP-заголовки',
    description: 'Примечание',
    cluster: 'Связанный кластер движка оповещений',
    cluster_tip:
      'В архитектуре с несколькими дата-центрами иногда развертывается несколько кластеров движка оповещений. Источник данных, соответствующий периферийному дата-центру, должен быть связан с кластером движка оповещений соответствующего дата-центра. Если у вас только один кластер, оставьте значение по умолчанию',
    cluster_confirm:
      'Обнаружено, что ваш источник данных не связан с кластером движка оповещений. Его нельзя будет использовать для оповещений. Хотите связать его с кластером движка оповещений?',
    cluster_confirm_ok: 'Не связывать',
    cluster_confirm_cancel: 'Связать',
    url_no_spaces_msg: 'URL не может содержать пробелы',
    prom: {
      write_addr_tip: 'Адрес для записи данных, генерируемых правилами записи. Примеры конфигурации для распространенных баз данных временных рядов',
      read_addr: 'Внутренний адрес базы данных временных рядов',
      read_addr_tip:
        'Обычно используется в сценариях с развертыванием движка оповещений в периферийном дата-центре. Если это поле не пусто, n9e-edge будет использовать этот адрес для доступа к базе данных временных рядов. Если это поле пусто, n9e-edge будет использовать URL, указанный выше, для доступа к базе данных временных рядов',
      url_tip: 'Примеры конфигурации для распространенных баз данных временных рядов (совместимых с API запросов Prometheus):',
      help_content: 'Не установлена база данных временных рядов? Обратитесь к <a>руководству по установке</a>',
      prom_installation_title: 'Руководство по установке',
      prom_installation:
        'На машине, где развернут Nightingale, выполните следующую команду для установки базы данных временных рядов Prometheus. В производственной среде рекомендуется развертывать кластерную версию VictoriaMetrics, см. <a>официальную документацию</a>',
      tsdb_type: 'Тип базы данных временных рядов',
    },
    es: {
      write_config: 'Конфигурация записи',
      disable_write: 'Запретить запись',
      enable_write: 'Разрешить запись',
      version: 'Версия',
      max_shard: 'Максимальное количество параллельных запросов к шардам',
      min_interval: 'Минимальный интервал времени (с)',
      min_interval_tip:
        'Нижний предел для автоматической группировки по временным интервалам. Рекомендуется установить значение, равное частоте записи, например, 1m, если данные записываются каждую минуту.',
    },
    jaeger: {
      version: 'Версия',
    },
    ck: {
      title: 'Основная информация о базе данных',
      addr: 'Адрес базы данных',
    },
    sls: {
      title: 'Точка входа в сервис',
      endpoint: 'Доменное имя доступа (частное доменное имя/публичное доменное имя/кросс-доменное имя)',
      access: 'Авторизация',
      endpoint_link: 'Инструкция по настройке',
    },
    os: {
      title: 'Информация об OpenSearch',
      enable_write_title: 'Настройка записи',
      enable_write: 'Разрешить запись',
    },
  },
};

export default ru_RU;
