const ru_RU = {
  preview: 'Предварительный просмотр данных',
  query: {
    title: 'Статистика запросов',
    execute: 'Выполнить',
    range: 'Диапазон запроса',
    power_sql: 'Расширенный SQL',
    query: 'Условия запроса',
    query_msg: 'Пожалуйста, введите условия запроса',
    query_tip1: 'Справка по синтаксису запросов IoTDB',
    query_tip2: 'Документация',
    sqlTemplates: 'Шаблоны запросов',
    sqlTemplates_tip: 'Следующие условия SQL-запросов приведены только для справки. При фактическом использовании необходимо заменить $переменные на реальные значения',
    sqlTemplates_load_failed: 'Не удалось загрузить шаблоны запросов',
    previewFailed: 'Не удалось выполнить предварительный просмотр данных',
    loadSchemaFailed: 'Не удалось загрузить схему',
    mode: {
      timeSeries: 'Временные ряды',
      raw: 'Исходные журналы',
    },
    advancedSettings: {
      title: 'Дополнительные настройки',
      metricKey_label: 'Поле значения',
      metricKey_tip: 'С помощью этого поля можно указать, какие поля будут использоваться как metricName.',
      tags_placeholder: 'Введите несколько тегов, нажав Enter',
      labelKey_label: 'Поле метки',
      labelKey_tip: 'С помощью этого поля можно указать, какие поля будут использоваться как labelName.',
      timeKey_label: 'Поле времени',
      timeKey_tip: 'Укажите, какое поле является полем времени; оно будет использоваться как координата оси X при построении графика',
      timeFormat_tip: 'Формат времени; время будет преобразовано в метку времени в соответствии с этим форматом',
    },
    schema: 'Схема',
    table: 'Таблицы',
  },
  trigger: {
    title: 'Условия срабатывания',
    value_msg: 'Введите значение выражения',
  },
};

export default ru_RU;
