const ru_RU = {
  title: 'Системная интеграция',
  edit: 'Редактировать',
  add: 'Добавить',
  name: 'Название',
  name_msg: 'Пожалуйста, введите название',
  url: 'Ссылка',
  url_msg: 'Пожалуйста, введите ссылку',
  visibility: 'Видимость',
  visibility_msg: 'Пожалуйста, выберите видимость',
  login_user_visible: 'Видимость для всех пользователей',
  team_visible: 'Видимость для команды',
  team_ids: 'Авторизованные команды',
  team_ids_msg: 'Пожалуйста, выберите команды',
  exitFullScreen_tip: 'Выход из полноэкранного режима ограничен функциональностью iframe, необходимо вручную удалить параметр viewMode=fullscreen в URL',
};

export default ru_RU;
