const ru_RU = {
  title: 'Интегрированные панели мониторинга',
  edit_title: 'Редактировать интегрированную панель мониторинга',
  add_title: 'Добавить интегрированную панель мониторинга',
  name: 'Название',
  name_msg: 'Пожалуйста, введите название',
  url: 'Ссылка',
  url_msg: 'Пожалуйста, введите ссылку',
  team_ids: 'Команды',
  exitFullScreen_tip: 'Выход из полноэкранного режима ограничен функциональностью iframe, необходимо вручную удалить параметр viewMode=fullscreen в URL',
};

export default ru_RU;
