const ru_RU = {
  title: 'Шаблоны сообщений',
  add_title: 'Добавить новый шаблон сообщений',
  edit_title: 'Редактировать шаблон сообщений',
  clone_title: 'Дублировать шаблон сообщений',
  user_group_ids: 'Команды',
  private: {
    '0': 'Публичное',
    '1': 'Частное',
    title: 'Режим отображения',
  },
  notify_channel_ident: 'Тип канала',
  content: {
    add_title: 'Добавить поле шаблона',
    edit_title: 'Редактировать поле шаблона',
    preview: 'Предварительный просмотр содержимого шаблона',
    contentKey: 'Идентификатор поля',
    tip: 'Вы можете использовать это поле в уведомлениях через $tpl.{{contentKey}}',
    prompt: 'Содержимое изменено, хотите отменить изменения?',
    value_msg: 'Пожалуйста, введите содержимое поля',
  },
  preview: {
    select_events: 'Выберите события для уведомления',
    result: 'Предварительный просмотр результата',
  },
};

export default ru_RU;
