const ru_RU = {
  title: 'Встроенные метрики',
  name: 'Название метрики',
  collector: 'Сборщик',
  typ: 'Тип',
  unit: 'Единица измерения',
  unit_tip: 'При построении графиков значения автоматически форматируются в соответствии с единицей измерения метрики',
  note: 'Описание',
  note_preview: 'Предварительный просмотр описания',
  expression: 'Выражение',
  add_btn: 'Создать метрику',
  clone_title: 'Дублировать метрику',
  edit_title: 'Редактировать метрику',
  explorer: 'Запрос',
  closePanelsBelow: 'Закрыть панели ниже',
  addPanel: 'Добавить панель',
  batch: {
    not_select: 'Пожалуйста, сначала выберите метрики',
    export: {
      title: 'Экспорт метрик',
    },
    import: {
      title: 'Импорт метрик',
      name: 'Название метрики',
      result: 'Результат импорта',
      errmsg: 'Сообщение об ошибке',
    },
  },
  filter: {
    title: 'Фильтр',
    title_tip:
      'Задача фильтра - ограничить количество собираемых данных при нажатии на нужную метрику для просмотра данных мониторинга метрики. Если настроено и выбрано условие фильтрации {ident="n9e01"}, то при запросе метрики cpu_usage_idle, фактический запрос будет cpu_usage_idle{ident="n9e01"}, что значительно сокращает объем запроса.',
    add_title: 'Добавить условие фильтрации',
    edit_title: 'Редактировать условие фильтрации',
    import_title: 'Импортировать фильтры',
    name: 'Имя',
    datasource: 'Источник данных',
    datasource_tip: 'Источник данных для помощи в запросе условий фильтрации',
    configs: 'Фильтр',
    groups_perm: 'Команды',
    groups_perm_gid_msg: 'Пожалуйста, выберите команду',
    perm: {
      '0': 'Только чтение',
      '1': 'Чтение и запись',
    },
    build_labelfilter_and_expression_error: 'Ошибка при создании фильтров по меткам и выражению',
    filter_label_msg: 'Метка не может быть пустой',
    filter_oper_msg: 'Оператор не может быть пустым',
    filter_value_msg: 'Значение метки не может быть пустым',
  },
};

export default ru_RU;
