const ru_RU = {
  title: 'Правила уведомлений',
  basic_configuration: 'Основная конфигурация',
  user_group_ids: 'Команды',
  user_group_ids_tip: 'Здесь введенные команды будут иметь право управлять или просматривать это правило уведомления',
  enabled_tip: 'Включено ли это правило уведомления',
  note_tip: 'Здесь вы можете добавить дополнительную информацию или пояснения для этого правила уведомления, чтобы облегчить его поддержку в будущем',
  notification_configuration: {
    title: 'Конфигурация уведомления',
    add_btn: 'Добавить конфигурацию уведомления',
    channel: 'Каналы связи',
    channel_tip:
      'Выберите, какие средства использовать для отправки уведомлений о событиях, если уже существующие не подходят, вы можете связаться с администратором для создания новых',
    channel_msg: 'Пожалуйста, выберите каналы связи',
    template: 'Шаблон сообщения',
    template_tip: 'Шаблон для содержимого уведомления, который можно использовать для различных сценариев',
    template_msg: 'Пожалуйста, выберите шаблон сообщения',
    severities: 'Применимые уровни',
    severities_tip:
      'Выберите, к каким уровням событий будет применяться это правило уведомления. Только те, которые выбраны, будут уведомляться. Если ни один из трех уровней не выбран, это средство уведомления не будет соответствовать событиям',
    time_ranges: 'Применимые временные диапазоны',
    time_ranges_tip: 'Правило уведомления может ограничивать действие только в определенные периоды времени, если не настроено, действие не ограничивается',
    effective_time_start: 'Начало',
    effective_time_end: 'Окончание',
    effective_time_week_msg: 'Пожалуйста, выберите период активации',
    effective_time_start_msg: 'Пожалуйста, укажите начало',
    effective_time_end_msg: 'Пожалуйста, укажите окончание',
    fetch_integration_key_failed_remove: 'Не удалось получить следующие ключи PagerDuty: {list}, пожалуйста, попробуйте снова выбрать',
    label_keys: 'Применимые теги',
    label_keys_tip:
      'Правило уведомления может ограничивать действие только для событий, соответствующих условиям (отфильтрованным по тегам), если не настроено, действие не ограничивается',
    attributes: 'Применимые атрибуты',
    attributes_value: 'Значение атрибута',
    attributes_tip: 'Правило уведомления может ограничивать действие только для событий, соответствующих определенным атрибутам, если не настроено, действие не ограничивается',
    attributes_options: {
      group_name: 'Бизнес-группа',
      cluster: 'Источник данных',
      is_recovered: 'Событие восстановления?',
      rule_id: 'Правило тревоги',
      severity: 'Уровень тревоги',
      target_group: 'Бизнес-группа хоста',
    },
    run_test_btn: 'Тестирование уведомления',
    run_test_btn_tip:
      'Вы можете протестировать эту конфигурацию уведомления, выбрав несколько событий, которые уже произошли, чтобы убедиться, что она работает правильно. Если все в порядке, вы должны получить соответствующее уведомление',
    run_test_request_result: 'Тестовое уведомление отправлено, цель уведомления вернула ответ как указано ниже:',
    user_info: {
      user_ids: 'Получатели',
      user_group_ids: 'Получающие команды',
      error: 'Получатели и получающие команды не могут быть пустыми одновременно',
    },
    flashduty: {
      ids: 'Пространство flashduty',
    },
    pagerduty: {
      services: 'Сервисы/Интеграции',
    },
  },
  user_group_id_invalid_tip: 'Команда не существует',
  channel_invalid_tip: 'Канал уведомления не существует',
  pipeline_configuration: {
    title: 'Обработка событий',
    name_placeholder: 'Пожалуйста, выберите обработку событий',
    name_required: 'Обработка событий не может быть пустой',
    add_btn: 'Добавить обработку событий',
  },
  escalations: {
    title: 'Конфигурация эскалации',
    title_tip:
      'Когда предупреждения превышают установленную продолжительность и не восстанавливаются, система будет эскалировать уведомления в указанные каналы согласно условиям ниже, чтобы избежать длительного отсутствия отслеживания. Подробную конфигурацию см. в <a>документации</a>',
    item_title: 'Эскалация уведомлений',
    item_add_btn: 'Добавить эскалацию уведомлений',
    interval: 'Интервал обнаружения',
    interval_required: 'Интервал обнаружения обязателен',
    duration_required: 'Продолжительность обязательна',
    duration_1: 'Когда аномальные события превысили',
    duration_2: 'и все еще находятся в',
    duration_3: 'статусе, используйте эту конфигурацию для отправки уведомлений.',
    repeating_notification: 'Настройки повторяющихся уведомлений',
    repeating_notification_tip: 'Если этот переключатель выключен, уведомление об эскалации для одного и того же события будет отправлено только один раз',
    repeating_notification_1: 'Каждые',
    repeating_notification_2: 'минут, до',
    repeating_notification_3: 'раз',
    notification_interval_required: 'Интервал уведомлений обязателен',
    notification_max_times_required: 'Максимальное количество повторяющихся уведомлений обязательно',
    event_status_options: {
      0: 'Не восстановлено',
      1: 'Не восстановлено и не принято',
    },
    time_ranges: {
      label_tip: 'Можно ограничить эскалацию только выбранными днями недели и периодами времени. Не сконфигурировано означает отсутствие ограничений',
    },
    labels_filter: {
      label_tip:
        'Выполнять эскалацию уведомлений только для событий предупреждений, которые соответствуют этим условиям меток. Используется для сужения области воздействия. Не сконфигурировано означает отсутствие ограничений. Поддерживает выпадающий выбор существующих ключей меток (рекомендуется) или ручной ввод',
    },
    attributes_filter: {
      label_tip:
        'Включать эскалацию только для предупреждений, которые одновременно соответствуют этим атрибутам; не сконфигурировано означает отсутствие ограничений. Множественные условия связаны оператором И',
    },
  },
  notify_aggr_configs: {
    title: 'Конфигурация агрегации',
    enable: 'Включить агрегацию',
    group_enable: 'Детализированная агрегация',
    group_title: 'Детализированная агрегация',
    group_add_btn: 'Добавить детализированную агрегацию',
    group_tip1: 'Соответствие следующим условиям',
    group_tip2: 'Агрегировать в одну группу для уведомления согласно следующим измерениям',
    group_label_keys: 'Метки',
    group_label_keys_required: 'Метки не могут быть пустыми',
    group_attribute_keys: 'Атрибуты',
    group_attribute_keys_required: 'Атрибуты не могут быть пустыми',
    group_keys_at_least_one_required: 'Необходимо заполнить по крайней мере одно из меток и атрибутов',
    group_duration_1: 'После получения предупреждения, предупреждения из той же группы, полученные в течение',
    group_duration_2: 'секунд, будут агрегированы и отправлены вместе',
    group_duration_required: 'Продолжительность агрегации не может быть пустой',
    default_title: 'Измерения по умолчанию',
    default_tip: 'Если вышеуказанные условия фильтрации не соответствуют, <b>агрегировать в одну группу для уведомления согласно следующим измерениям</b>',
    default_duration_tip: 'Обратите внимание, что слишком большие интервалы времени агрегации приведут к задержке доставки предупреждений',
    default_duration_tip2: 'Максимальный интервал агрегации не может превышать 3600 секунд',
    attribute_keys_map: {
      cluster: 'Источник данных',
      group_name: 'Бизнес-группа',
      rule_id: 'Правило предупреждения',
      severity: 'Уровень предупреждения',
    },
    enable_tip: 'После включения предупреждения, соответствующие правилам, будут объединены по измерениям в одно уведомление <a>документация</a>',
    labels_filter: {
      label_tip:
        'Выполнять агрегацию уведомлений только для событий предупреждений, которые соответствуют этим условиям меток. Используется для сужения области воздействия. Не сконфигурировано означает отсутствие ограничений. Поддерживает выпадающий выбор существующих ключей меток (рекомендуется) или ручной ввод',
    },
    attributes_filter: {
      label_tip:
        'Позволить только предупреждениям, соответствующим этим условиям фильтрации меток, участвовать в агрегации, несоответствующие предупреждения не затрагиваются этим правилом<br />Множественные условия связаны оператором И, и также связаны оператором И с применимыми условиями фильтрации атрибутов ниже',
    },
    label_keys: {
      tip: 'Если сконфигурировано как ident, события с одинаковым ident будут объединены в одну группу и отправлено одно уведомление, обычно используется для снижения шума SMS/IM',
      placeholder: 'Например: ident, app. Поддерживает выпадающий выбор существующих ключей меток (рекомендуется) или ручной ввод',
    },
    attribute_keys: {
      tip: 'Если сконфигурировано как Бизнес-группа, события с одинаковой Бизнес-группой будут объединены в одну группу и отправлено одно уведомление',
      placeholder: 'Например: Бизнес-группа',
    },
  },
  statistics: {
    total_notify_events: 'Всего уведомлений за последние {{days}} дней',
    total_notify_events_tip: 'Статистика фактического количества отправленных уведомлений; события, которые были <b>свернуты, подавлены или заблокированы</b>, не учитываются',
    escalation_events: 'Эскалация уведомлений за последние {{days}} дней',
    escalation_events_tip:
      'Количество событий, соответствующих правилам эскалации и повышенных в приоритете; большое количество обычно означает более длительный цикл обработки, необходимо оптимизировать <b>ответ SLA/порог эскалации/стратегию снижения шума тревоги</b>',
    noise_reduction_ratio: 'Коэффициент снижения шума за последние {{days}} дней',
    noise_reduction_ratio_tip:
      'Коэффициент снижения шума = <b>(1 − фактическое количество отправленных уведомлений ÷ исходное количество событий тревоги) × 100%</b>; чем ближе значение к <b>100%</b>, тем лучше <b>эффект снижения шума</b>',
  },
  tabs: {
    events: 'Список событий',
    rules: 'Правила тревоги',
    sub_rules: 'Правила подписки',
  },
};

export default ru_RU;
