const ru_RU = {
  title: 'Правила уведомлений',
  basic_configuration: 'Основная конфигурация',
  user_group_ids: 'Команды',
  user_group_ids_tip: 'Здесь введенные команды будут иметь право управлять или просматривать это правило уведомления',
  enabled_tip: 'Включено ли это правило уведомления',
  note_tip: 'Здесь вы можете добавить дополнительную информацию или пояснения для этого правила уведомления, чтобы облегчить его поддержку в будущем',
  notification_configuration: {
    title: 'Конфигурация уведомления',
    add_btn: 'Добавить конфигурацию уведомления',
    channel: 'Каналы связи',
    channel_tip:
      'Выберите, какие средства использовать для отправки уведомлений о событиях, если уже существующие не подходят, вы можете связаться с администратором для создания новых',
    channel_msg: 'Пожалуйста, выберите каналы связи',
    template: 'Шаблон сообщения',
    template_tip: 'Шаблон для содержимого уведомления, который можно использовать для различных сценариев',
    template_msg: 'Пожалуйста, выберите шаблон сообщения',
    severities: 'Применимые уровни',
    severities_tip:
      'Выберите, к каким уровням событий будет применяться это правило уведомления. Только те, которые выбраны, будут уведомляться. Если ни один из трех уровней не выбран, это средство уведомления не будет соответствовать событиям',
    time_ranges: 'Применимые временные диапазоны',
    time_ranges_tip: 'Правило уведомления может ограничивать действие только в определенные периоды времени, если не настроено, действие не ограничивается',
    effective_time_start: 'Начало',
    effective_time_end: 'Окончание',
    effective_time_week_msg: 'Пожалуйста, выберите период активации',
    effective_time_start_msg: 'Пожалуйста, укажите начало',
    effective_time_end_msg: 'Пожалуйста, укажите окончание',
    label_keys: 'Применимые теги',
    label_keys_tip:
      'Правило уведомления может ограничивать действие только для событий, соответствующих условиям (отфильтрованным по тегам), если не настроено, действие не ограничивается',
    attributes: 'Применимые атрибуты',
    attributes_value: 'Значение атрибута',
    attributes_tip: 'Правило уведомления может ограничивать действие только для событий, соответствующих определенным атрибутам, если не настроено, действие не ограничивается',
    attributes_options: {
      group_name: 'Бизнес-группа',
      cluster: 'Источник данных',
    },
    run_test_btn: 'Тестирование уведомления',
    run_test_btn_tip:
      'Вы можете протестировать эту конфигурацию уведомления, выбрав несколько событий, которые уже произошли, чтобы убедиться, что она работает правильно. Если все в порядке, вы должны получить соответствующее уведомление',
    run_test_request_success: 'Тестирование успешно завершено',
    user_info: {
      user_ids: 'Получатели',
      user_group_ids: 'Получающие команды',
      error: 'Получатели и получающие команды не могут быть пустыми одновременно',
    },
    flashduty: {
      ids: 'Пространство flashduty',
    },
  },
  user_group_id_invalid_tip: 'Команда не существует',
  channel_invalid_tip: 'Канал уведомления не существует',
};

export default ru_RU;
