const ru_RU = {
  user: {
    title: 'Пользователи',
    search_placeholder: 'Имя пользователя, электронная почта или номер телефона',
    create: 'Создать пользователя',
    edit: 'Редактировать пользователя',
    busi_groups: 'Бизнес-группа',
    user_groups: 'Команда',
    last_active_time: 'Последнее время активности',
  },
  team: {
    title: 'Команды',
    list: 'Список команд',
    search_placeholder: 'Имя пользователя, отображаемое имя, электронная почта или номер телефона',
    create: 'Создать команду',
    edit: 'Редактировать команду',
    add_member: 'Добавить участника',
    empty: 'У вас нет команд, связанных с вами, пожалуйста,',
    name: 'Название команды',
    add_member_selected: 'Выбрано {{num}} элементов',
  },
  business: {
    title: 'Бизнес-группы',
    list: 'Бизнес-группа',
    search_placeholder: 'Название',
    team_search_placeholder: 'Поиск названия команды',
    create: 'Создать бизнес-группу',
    edit: 'Редактировать бизнес-группу',
    add_team: 'Авторизовать команду',
    perm_flag: 'Права',
    note_content:
      'Правила оповещения, события мониторинга, объекты мониторинга, скрипты самовосстановления и т.д. относятся к бизнес-группе, это организация, которая может быть замкнутой в системе',
    empty: 'Бизнес-группа (объекты мониторинга, панели мониторинга, правила оповещения, скрипты самовосстановления должны принадлежать бизнес-группе) пуста, пожалуйста,',
    name: 'Название бизнес-группы',
    name_tip:
      '\n      После разделения по {{separator}} будет рендериться в виде дерева <1 />\n      Например: redis{{separator}}мониторинг и redis{{separator}}вход в систему отображаются следующим образом  <1 />\n      redis <1 />\n      - мониторинг <1 />\n      - вход в систему <1 />\n    ',
    team_name: 'Команда',
    perm_flag_0: 'Только чтение',
    perm_flag_1: 'Чтение и запись',
    user_group_msg: 'Команда бизнес-группы не может быть пустой',
  },
  disbale: 'Отключить',
  enable: 'Включить',
  ok_and_search: 'ОК и поиск',
};

export default ru_RU;
