const ru_RU = {
  preview: 'Предварительный просмотр данных',
  query: {
    title: 'Статистика запросов',
    execute: 'Выполнить',
    query: 'Условия запроса',
    query_required: 'Условия запроса не могут быть пустыми',
    query_placeholder: 'Введите SQL для запроса, нажмите Shift+Enter для переноса строки',
    query_placeholder2: 'Нажмите Shift+Enter для переноса строки',
    advancedSettings: {
      title: 'Дополнительные настройки',
      tags_placeholder: 'Введите несколько тегов, нажав Enter',
      valueKey: 'Поле значения',
      valueKey_tip: 'Результаты SQL-запросов обычно содержат несколько столбцов, вы можете указать, какие столбцы использовать в качестве кривых для отображения на графике',
      valueKey_required: 'Поле значения не может быть пустым',
      labelKey: 'Поле метки',
      labelKey_tip: 'Результаты SQL-запросов обычно содержат несколько столбцов, вы можете указать, какие столбцы использовать в качестве метаданных для кривых',
    },
    schema: 'Схема',
    document: 'Документ',
    dashboard: {
      mode: {
        label: 'Режим запроса',
        table: 'Невременные данные',
        timeSeries: 'Временные ряды',
      },
    },
    historicalRecords: {
      button: 'Исторические записи',
      searchPlaceholder: 'Поиск исторических записей',
    },
    compass_btn_tip: 'Нажмите, чтобы просмотреть данные таблицы',
  },
  trigger: {
    title: 'Условия срабатывания',
    value_msg: 'Введите значение выражения',
  },
  datasource: {
    shards: {
      title: 'Основная информация о источнике данных',
      title_tip:
        'Подключение к базе данных зависит от того, предоставил ли DBA соответствующие права пользователю базы данных. Если подключение невозможно, вы можете продолжить настройку, а затем проверить позже.',
      addr: 'Адрес базы данных',
      addr_tip: 'Адрес базы данных должен быть уникальным',
      user: 'Имя пользователя',
      password: 'Пароль',
      help: 'Примечание: Учетная запись должна иметь права на чтение для соответствующей базы данных, чтобы продолжить последующие операции. Если вы изменяете учетную запись, старайтесь использовать учетную запись только для чтения.',
    },
    max_query_rows: 'Максимальное количество строк, разрешенное для извлечения в одном запросе',
    max_idle_conns: 'Максимальное количество неактивных соединений',
    max_open_conns: 'Максимальное количество открытых соединений',
    conn_max_lifetime: 'Максимальное время жизни соединения (в секундах)',
    timeout: 'Время ожидания (в секундах)',
  },
};
export default ru_RU;
