const ru_RU = {
  tip: 'В настоящее время функция представлений поддерживает только источники данных Prometheus и Doris',
  placeholder: 'Фильтровать представления',
  save_new: 'Сохранить как новое представление',
  save: 'Сохранить представление',
  edit: 'Редактировать представление',
  delete: 'Удалить представление',
  confirm_delete: 'Вы уверены, что хотите удалить это представление?',
  name: 'Название представления',
  name_placeholder: 'Введите название представления',
  public_cate: 'Видимость',
  public_cate_placeholder: 'Все',
  public_cate_0: 'Только я',
  public_cate_1: 'Видно команде',
  public_cate_2: 'Видно всем',
  search_placeholder: 'Поиск представлений',
  gids: 'Команда',
  post_favorite: 'Представление добавлено в избранное',
  delete_favorite: 'Представление удалено из избранного',
};

export default ru_RU;
