const ru_RU = {
  preview: 'Предварительный просмотр данных',
  query: {
    title: 'Статистика запросов',
    execute: 'Выполнить',
    query: 'Условия запроса',
    query_required: 'Условия запроса не могут быть пустыми',
    query_placeholder: 'Введите SQL для запроса, нажмите Shift+Enter для переноса строки',
    query_placeholder2: 'Нажмите Shift+Enter для переноса строки',
    advancedSettings: {
      title: 'Дополнительные настройки',
      tags_placeholder: 'Введите несколько тегов, нажав Enter',
      valueKey: 'Поле значения',
      valueKey_tip: 'Результаты SQL-запросов обычно содержат несколько столбцов, вы можете указать, какие столбцы использовать в качестве кривых для отображения на графике',
      valueKey_required: 'Поле значения не может быть пустым',
      labelKey: 'Поле метки',
      labelKey_tip: 'Результаты SQL-запросов обычно содержат несколько столбцов, вы можете указать, какие столбцы использовать в качестве метаданных для кривых',
    },
    schema: 'Схема',
    document: 'Документ',
    dashboard: {
      mode: {
        label: 'Режим запроса',
        table: 'Невременные данные',
        timeSeries: 'Временные ряды',
      },
    },
    historicalRecords: {
      button: 'Исторические записи',
      searchPlaceholder: 'Поиск исторических записей',
    },
    compass_btn_tip: 'Нажмите, чтобы просмотреть данные таблицы',
  },
  trigger: {
    title: 'Условия срабатывания',
    value_msg: 'Введите значение выражения',
  },
};
export default ru_RU;
