const ja_JP = {
  title: "スクリーンルール",
  search_placeholder: "タグ、スクリーンの理由を検索",
  datasource_type: "データソースタイプ",
  datasource_id: "データソース",
  cause: "スクリーンの理由",
  time: "スクリーンの時間",
  note: "ルールの説明",
  btime: "スクリーンの開始時間",
  duration: "スクリーンの持続時間",
  etime: "スクリーンの終了時間",
  prod: "監視タイプ",
  severities: "イベントのレベル",
  severities_msg: "イベントのレベルは空にできません",
  mute_type: {
    "0": "固定時間",
    "1": "周期時間",
    label: "スクリーンの時間タイプ",
    days_of_week: "スクリーンの時間",
    start: "開始時間",
    start_msg: "開始時間は空にできません",
    end: "終了時間",
    end_msg: "終了時間は空にできません",
  },
  tag: {
    key: {
      label: "イベントのタグキー",
      tip: "ここでのタグは、アラートイベントのタグを指し、以下のタグマッチングルールでアラートイベントをフィルタリングします",
      msg: "keyは空にできません",
    },
    func: {
      label: "演算子",
      msg: "演算子は空にできません",
    },
    value: {
      label: "タグの値",
      placeholder1: "複数の値を入力できます。改行で区切ってください",
      placeholder2: "正規表現を使用してタグの値をマッチングしてください",
      msg: "値は空にできません",
    },
    add: "タグのフィルタリング条件を追加",
  },
  quick_template: {
    title: "クイックタグフィルターテンプレート",
    all: "このグループの全てのアラートをスクリーン",
    target_miss: "機器の接続が失われた場合のスクリーン",
    __name__: "特定の指標をスクリーン",
    ident: "特定の機器をスクリーン",
  },
  basic_configs: "基本情報",
  filter_configs: "フィルタリング設定",
  filter_configs_tip:
    "フィルタリング条件に一致するアラートイベントはスクリーンルールにマッチし、スクリーンされます。フィルタリング条件は本質的にアラートイベントのフィルタリングであり、イベントのデータソース、レベル、タグなどを通じて行われます",
  mute_configs: "スクリーンの持続時間",
  alert_content:
    "会社の全てのアラートを誤ってスクリーンしないために、このスクリーンルールは特定のビジネスグループ下のアラートイベントにのみ適用されます",
  preview_muted_btn: "プレビューして関連するイベントを削除",
};

export default ja_JP;
