const ru_RU = {
  title: 'Режим тишины',
  search_placeholder: 'Поиск по описанию правила, тегам, причине блокировки',
  datasource_type: 'Тип источника данных',
  datasource_id: 'Источник данных',
  cause: 'Причина блокировки',
  time: 'Время блокировки',
  note: 'Описание правила',
  btime: 'Время начала блокировки',
  duration: 'Длительность блокировки',
  etime: 'Время окончания блокировки',
  prod: 'Тип мониторинга',
  severities: 'Уровень событий',
  severities_msg: 'Уровень событий не может быть пустым',
  mute_type: {
    '0': 'По времени',
    '1': 'По расписанию',
    label: 'Тип блокировки',
    days_of_week: 'Время блокировки',
    start: 'Время начала',
    start_msg: 'Время начала не может быть пустым',
    end: 'Время окончания',
    end_msg: 'Время окончания не может быть пустым',
  },
  tag: {
    key: {
      label: 'Ключ тега события',
      tip: 'Здесь теги относятся к тегам событий оповещений, фильтрация оповещений происходит по правилам соответствия тегов',
      msg: 'Ключ не может быть пустым',
    },
    func: {
      label: 'Оператор',
      msg: 'Оператор не может быть пустым',
    },
    value: {
      label: 'Значение тега',
      placeholder1: 'Можно ввести несколько значений, разделяя их клавишей Enter',
      placeholder2: 'Введите регулярное выражение для соответствия значению тега',
      msg: 'Значение не может быть пустым',
    },
    add: 'Добавить условие фильтрации по тегу',
  },
  quick_template: {
    title: 'Шаблоны быстрой фильтрации по тегам',
    all: 'Блокировка всех оповещений в этой группе',
    target_miss: 'Блокировка потери связи с устройством',
    __name__: 'Блокировка определенной метрики',
    ident: 'Блокировка определенного устройства',
  },
  basic_configs: 'Основная информация',
  filter_configs: 'Фильтр',
  filter_configs_tip:
    'События оповещений, соответствующие условиям фильтрации, будут попадать под режим тишины и, следовательно, блокироваться. Фильтры по сути являются фильтрацией событий оповещений по источнику данных, уровню, тегам и другой информации события',
  mute_configs: 'Продолжительность блокировки',
  alert_content:
    'Чтобы предотвратить ошибочную блокировку всех оповещений компании, это правило блокировки будет действовать только для событий оповещений в определенной бизнес-группе',
  preview_muted_title: 'Предварительный просмотр соответствующих событий',
  preview_muted_save_only: 'Только сохранить',
  preview_muted_save_and_delete: 'Сохранить и удалить соответствующие события',
};

export default ru_RU;
