const ru_RU = {
  title: 'Режим тишины',
  search_placeholder: 'Поиск по описанию заголовок, тегам, причине блокировки',
  datasource_type: 'Тип источника данных',
  datasource_id: 'Источник данных',
  cause: 'Причина блокировки',
  time: 'Время блокировки',
  note: 'Описание заголовок',
  btime: 'Время начала блокировки',
  duration: 'Длительность блокировки',
  etime: 'Время окончания блокировки',
  prod: 'Тип мониторинга',
  severities: 'Уровень событий',
  severities_msg: 'Уровень событий не может быть пустым',
  mute_type: {
    '0': 'По времени',
    '1': 'По расписанию',
    label: 'Тип блокировки',
    days_of_week: 'Время блокировки',
    start: 'Время начала',
    start_msg: 'Время начала не может быть пустым',
    end: 'Время окончания',
    end_msg: 'Время окончания не может быть пустым',
  },
  tag: {
    key: {
      label: 'Теги событий',
      tip: `Теги здесь относятся к тегам событий оповещения, которые фильтруют события оповещения через следующие правила сопоставления тегов. Поддерживаются несколько операторов сопоставления, объяснение следующее:

- \`==\` сопоставляет конкретное значение тега, можно заполнить только одно. Если вы хотите сопоставить несколько значений одновременно, следует использовать оператор \`in\`
- \`=~\` заполняет регулярное выражение для гибкого сопоставления значений тегов
- \`in\` сопоставляет несколько значений тегов, аналогично операции \`in\` в SQL
- \`not in\` не сопоставляет значения тегов, можно заполнить несколько значений, аналогично операции \`not in\` в SQL, используется для исключения нескольких значений тегов
- \`!=\` не равно, используется для исключения конкретного значения тега
- \`!~\` не сопоставляет регулярное выражение, заполняет регулярное выражение, и значения тегов, соответствующие этому регулярному выражению, будут исключены, аналогично \`!~\` в PromQL`,
    },
  },

  basic_configs: 'Основная информация',
  filter_configs: 'Фильтр',
  filter_configs_tip:
    'События оповещений, соответствующие условиям фильтрации, будут попадать под режим тишины и, следовательно, блокироваться. Фильтры по сути являются фильтрацией событий оповещений по источнику данных, уровню, тегам и другой информации события',
  mute_configs: 'Продолжительность блокировки',
  alert_content:
    'Чтобы предотвратить ошибочную блокировку всех оповещений компании, это правило блокировки будет действовать только для событий оповещений в определенной бизнес-группе',
  preview_muted_title: 'Предварительный просмотр соответствующих событий',
  preview_muted_save_only: 'Только сохранить',
  preview_muted_save_and_delete: 'Сохранить и удалить соответствующие события',
  expired: 'Истекший',
};

export default ru_RU;
