const ru_RU = {
  preview: 'Предварительный просмотр данных',
  query: {
    title: 'Статистика запросов',
    execute: 'Выполнить',
    project: 'Проект',
    project_msg: 'Пожалуйста, выберите проект',
    project_tip: `
      <1>Проект — это единица управления ресурсами службы журналов и основная граница для изоляции пользователей и контроля доступа. Дополнительную информацию см. в разделе<1>
      <2>Проект</2>
    `,
    logstore: 'Logstore',
    logstore_msg: 'Пожалуйста, выберите Logstore',
    logstore_tip: `
      <1>Logstore — это единица сбора, хранения и запроса данных журналов в службе журналов. Дополнительную информацию см. в разделе<1>
      <2>Logstore</2>
    `,
    range: 'Диапазон запроса',
    power_sql: 'Расширенный SQL',
    query: 'Условия запроса',
    query_msg: 'Пожалуйста, введите условия запроса',
    query_tip1: 'Справка по синтаксису запросов TDengine',
    query_tip2: 'Документация',
    sqlTemplates: 'Шаблоны запросов',
    sqlTemplates_tip: 'Следующие условия SQL-запросов приведены только для справки. При фактическом использовании необходимо заменить $переменные на реальные значения',
    mode: {
      timeSeries: 'Временные ряды',
      raw: 'Исходные журналы',
    },
    advancedSettings: {
      title: 'Дополнительные настройки',
      metricKey_tip:
        'С помощью этого поля можно указать, какие поля будут использоваться как metricName. По умолчанию числовые поля используются как metricName. Например, если результат запроса used_percent:96 host:host01, то used_percent будет metricName, а значение — 96',
      tags_placeholder: 'Введите несколько тегов, нажав Enter',
      labelKey_tip:
        'С помощью этого поля можно указать, какие поля будут использоваться как labelName. По умолчанию нечисловые поля используются как labelName. Например, если результат запроса used_percent:96 host:host01, то host будет именем метки, а host01 — значением метки',
      timeKey_tip: 'Укажите, какое поле является полем времени; оно будет использоваться как координата оси X при построении графика',
      timeFormat_tip: 'Формат времени; время будет преобразовано в метку времени в соответствии с этим форматом',
    },
    schema: 'Схема',
    table: 'Таблица',
    stable: 'Супертаблица',
  },
  trigger: {
    title: 'Условия срабатывания',
    value_msg: 'Введите значение выражения',
  },
};
export default ru_RU;
