const ja_JP = {
  customTip: `ログのラベルはすべて変数として参照できます。例：$key1、$key2、$a.b
    <1 />組み込み変数：
    <1 /><2 />開始・終了時刻：$__from と $__to、デフォルトの単位はミリ秒
    <1 /><2 />フォーマットが必要な場合は $__time_format__ を使用できます。形式は unix、YYYY-MM-DD HH:mm:ss など
    <1 /><2 />本システムのアドレス：$local_url（プロトコルとドメインを含む）`,
  linkBuilderTip: 'ジャンプリンクジェネレーター',
  时间范围: '時間範囲',
  继承当前查询时间: '現在のクエリ時間を引き継ぐ',
  业务组: 'ビジネスグループ',
  请选择: '選択してください',
  请选择业务组: 'ビジネスグループを選択してください',
  仪表盘: 'ダッシュボード',
  请选择仪表盘: 'ダッシュボードを選択してください',
  设置仪表盘变量: 'ダッシュボード変数を設定',
  可选变量: '利用可能な変数',
  预览结果: 'プレビュー結果',
  请输入地址: 'アドレスを入力してください',
  请输入: '入力してください',
  生成: '生成',
  下钻到: 'ドリルダウン先',
  自定义链接: 'カスタムリンク',
  日志检索: 'ログ検索',
};

export default ja_JP;
