const ko_KR = {
  "customTip": "로그의 레이블은 모두 변수로 참조할 수 있습니다. 예를 들어 $key1, $key2, $a.b처럼 씁니다\n<1 />내장 변수:\n<1 /><2 />시작·종료 시각: $__from과 $__to이며 기본 단위는 밀리초입니다\n<1 /><2 />형식을 지정하려면 $__time_format__을 함께 쓰며 unix, utc, YYYY-MM-DD HH:mm:ss 등을 사용할 수 있습니다\n<1 /><2 />이 시스템 주소: $local_url이며 프로토콜과 도메인을 포함합니다",
  "linkBuilderTip": "이동 링크 생성기",
  "时间范围": "시간 범위",
  "继承当前查询时间": "현재 쿼리 시간 사용",
  "业务组": "비즈니스 그룹",
  "请选择": "선택하세요",
  "请选择业务组": "비즈니스 그룹을 선택하세요",
  "仪表盘": "대시보드",
  "请选择仪表盘": "대시보드를 선택하세요",
  "设置仪表盘变量": "대시보드 변수 설정",
  "可选变量": "사용 가능한 변수",
  "预览结果": "미리보기 결과",
  "请输入地址": "주소를 입력하세요",
  "请输入": "입력하세요",
  "生成": "생성",
  "下钻到": "드릴다운 대상",
  "自定义链接": "사용자 지정 링크",
  "日志检索": "로그 검색"
};

export default ko_KR;
