const ru_RU = {
  customTip: `Все метки логов можно использовать как переменные, например $key1, $key2, $a.b
    <1 />Встроенные переменные:
    <1 /><2 />Время начала и окончания: $__from и $__to, единица по умолчанию — миллисекунды
    <1 /><2 />Для форматирования можно использовать $__time_format__, форматы включают unix, YYYY-MM-DD HH:mm:ss и др.
    <1 /><2 />Адрес системы: $local_url, включая протокол и домен`,
  linkBuilderTip: 'Генератор ссылок перехода',
  时间范围: 'Диапазон времени',
  继承当前查询时间: 'Наследовать текущее время запроса',
  业务组: 'Бизнес-группа',
  请选择: 'Выберите',
  请选择业务组: 'Выберите бизнес-группу',
  仪表盘: 'Панель мониторинга',
  请选择仪表盘: 'Выберите панель мониторинга',
  设置仪表盘变量: 'Настроить переменные панели',
  可选变量: 'Доступные переменные',
  预览结果: 'Предпросмотр результата',
  请输入地址: 'Введите адрес',
  请输入: 'Введите',
  生成: 'Сгенерировать',
  下钻到: 'Перейти к',
  自定义链接: 'Пользовательская ссылка',
  日志检索: 'Поиск логов',
};

export default ru_RU;
