const zh_CN = {
  customTip: `日志的标签均可被作为变量引用，如$key1，$key2，$a.b
<1 />内置变量：
<1 /><2 />起止时间：$__from和$__to, 默认单位为毫秒
<1 /><2 />如需格式化可带入$__time_format__,格式包括 unix、utc、YYYY-MM-DD HH:mm:ss 等
<1 /><2 />本系统地址：$local_url，包含了协议和域名`,
  linkBuilderTip: '跳转链接生成器',
  时间范围: '时间范围',
  继承当前查询时间: '继承当前查询时间',
  业务组: '业务组',
  请选择: '请选择',
  请选择业务组: '请选择业务组',
  仪表盘: '仪表盘',
  请选择仪表盘: '请选择仪表盘',
  设置仪表盘变量: '设置仪表盘变量',
  可选变量: '可选变量',
  预览结果: '预览结果',
  请输入地址: '请输入地址',
  请输入: '请输入',
  生成: '生成',
  下钻到: '下钻到',
  自定义链接: '自定义链接',
  日志检索: '日志检索',
};

export default zh_CN;
