const ru_RU = {
  feedback: 'Обратная связь',
  title: 'Возникли проблемы? Следуйте этим шагам для их решения',
  ai: {
    title: 'AI Умный Вопрос-Ответ',
    description: 'Получите ответы быстро с помощью AI',
    link_btn: 'Перейти',
  },
  docs: {
    title: 'Обратитесь к официальной документации',
    description: 'Подробные описания функций и руководства по использованию',
    link_btn: 'Просмотреть',
  },
  issues: {
    title: 'Подать проблему',
    description: 'Все еще не решено? Обратитесь за помощью к сообществу',
    link_btn: 'Задать вопрос',
  },
};

export default ru_RU;
