const ru_RU = {
  modal: {
    title: 'Настройки переноса',
    success: 'Перенос выполнен успешно',
    datasource_variable: 'Настройка переменной источника данных',
    variable_name: 'Имя переменной',
    variable_name_required: 'Укажите имя переменной',
    datasource_type: 'Тип источника данных',
    datasource_default: 'Источник данных по умолчанию',
  },
  title: 'Перенос панелей',
  migrate: 'Перенос',
  help: '\n  v6 версия больше не поддерживает глобальный переключатель кластера Prometheus, но новая версия может реализовать эту функцию с помощью переменных данных панели. \n  <br />\n  Инструмент переноса создаст переменные данных и все несвязанные панели данных. \n  <br />\n  Вот список панелей для переноса, нажмите кнопку переноса, чтобы начать перенос. \n  ',
};

export default ru_RU;
