const ja_JP = {
  快捷查询: 'クイッククエリ',
  自定义查询: 'カスタムクエリ',
  '自定义查询 支持用户根据SQL语法自由输入查询语句': 'カスタムクエリ SQL構文に基づいて自由にクエリステートメントを入力できます',
  '快捷查询 根据固定的SQL模板，快速生成查询语句，比如字段A大于0，只需要输入 A > 0，通过点击该按钮可以快速切换到自定义模式，支持查看并修改SQL语句':
    'クイッククエリ 固定のSQLテンプレートに基づいて、クエリステートメントを迅速に生成します。たとえば、フィールドAが0より大きい場合、A>0と入力するだけです。このボタンをクリックすると、クイックモードに迅速に切り替えて、SQLステートメントを表示および変更できます',
  当前数据库: 'データベース',
  数据表: 'テーブル',
  请先选择数据库和数据表: 'データベースとテーブルを選択してください',
  query: {
    mode: {
      raw: '生データ',
      metric: '統計グラフ',
    },
    time_field: '時間フィールド',
    time_field_msg: '時間フィールドを入力してください',
    sql_msg: 'SQLステートメントを入力してください',
    execute: 'クエリ',
    advancedSettings: {
      title: '詳細設定',
      valueKey: '値フィールド',
      valueKey_tip: 'SQLクエリの結果には通常、複数の列が含まれています。どの列の値をグラフに表示するかを指定できます',
      valueKey_required: '値フィールドは空にできません',
      labelKey: 'ラベルフィールド',
      labelKey_tip: 'SQLクエリの結果には通常、複数の列が含まれています。どの列を曲線のラベルメタデータとして使用するかを指定できます',
    },
  },
};

export default ja_JP;
