const ru_RU = {
  quick_query: 'Быстрый запрос',
  quick_query_tip:
    'Быстрый запрос позволяет быстро сгенерировать запрос на основе фиксированного шаблона SQL. Например, если поле A больше 0, достаточно ввести A > 0. Нажав эту кнопку, вы можете быстро переключиться в режим пользовательского запроса, чтобы просмотреть и изменить SQL-запрос.',
  custom_query: 'Пользовательский запрос',
  custom_query_tip: 'Пользовательский запрос позволяет пользователям свободно вводить запросы на основе синтаксиса SQL',
  current_database: 'Текущая база данных',
  table: 'Таблица',
  database_table_required: 'Пожалуйста, выберите базу данных и таблицу',
  query: {
    mode: {
      query: 'Режим запроса',
      sql: 'Режим SQL',
    },
    submode: {
      raw: 'Исходный текст журнала',
      timeSeries: 'Временная диаграмма',
    },
    query_tip: `Примеры SQL:<br />
    1. Запрос количества строк журнала за последние 5 минут SELECT count() as cnt from database.table WHERE date >= DATE_SUB(NOW(), INTERVAL 5 MINUTE)<br />
    2. Запрос количества строк журнала за выбранный интервал времени SELECT COUNT(*) AS \`cnt\` FROM \`database\`.\`table\` WHERE $__timeFilter(\`timestamp\`)<br />
    Дополнительную информацию о режиме SQL см. в разделе <a>Режим Doris SQL</a>`,
    query_placeholder: 'SELECT count(*) as count FROM db_name.table_name WHERE ts >= now() - 5m',
    execute: 'Запрос',
    database: 'База данных',
    database_msg: 'Пожалуйста, выберите базу данных',
    table: 'Таблица',
    table_msg: 'Пожалуйста, выберите таблицу',
    time_field: 'Дата поле',
    time_field_msg: 'Пожалуйста, выберите дата поле',
    time_field_tip:
      '<span>Чтобы связать этот выбор времени, вам нужно использовать временной макрос в условии запроса</span><br/>Введение в использование временных макросов: <a>Подробнее</a>',
    query: 'Запрос',
    query_required: 'Запрос является обязательным',
    advancedSettings: {
      title: 'Дополнительные настройки',
      tags_placeholder: 'Введите несколько значений через Enter',
      valueKey: 'Значение поля',
      valueKey_tip:
        'Результаты запроса SQL обычно содержат несколько столбцов. Вы можете указать, какие столбцы использовать в качестве значений для отображения кривых на графике.',
      valueKey_required: 'Значение поля не может быть пустым',
      labelKey: 'Метка поля',
      labelKey_tip: 'Результаты запроса SQL обычно содержат несколько столбцов. Вы можете указать, какие столбцы использовать в качестве метаданных меток кривых.',
    },
    get_index_fail: 'Получение индекса таблицы не удалось',
    warn_message_btn_1: 'Продолжить отправку запроса',
    warn_message_btn_2: 'Вернуться к изменению',
    warn_message: 'Условие запроса не содержит временной макрос, выбранный временной диапазон не будет применен!',
    warn_message_content_1:
      'Это условие запроса может вызвать полное сканирование таблицы. Пожалуйста, самостоятельно оцените влияние на производительность хранилища и решите, продолжать ли отправку запроса или вернуться к изменению и добавить временной макрос.',
    warn_message_content_2: 'Распространенные временные макросы: ',
    warn_message_content_3: 'Пример:',
    warn_message_content_4: 'Использование временных макросов: <a>Подробнее</a>',
    dashboard: {
      mode: {
        label: 'Режим запроса',
        table: 'Невременные данные',
        timeSeries: 'Временные ряды',
      },
    },
    stackByField: 'Поле для накопления',
    stack_disabled_tip: 'Гистограммы с накоплением не поддерживаются, когда количество уникальных значений равно 1 или превышает 10',
    stack_tip_pin: 'Включить гистограмму с накоплением',
    stack_tip_unpin: 'Отключить гистограмму с накоплением',
    stack_group_by_tip: 'Отображение накопленной диаграммы тенденций по значению этого поля',
    sql_format: {
      title: 'SQL предварительный просмотр',
      tip: 'Максимальные, минимальные, процентильные и другие сложные SQL-поля можно просмотреть, щелкнув список полей слева.',
      origin: 'Просмотреть исходные журналы',
      origin_tip: 'Для режима Log Explorer - Raw',
      timeseries: 'Просмотреть временные ряды',
      timeseries_tip: 'Для режима Log Explorer - Time Series или для построения временных диаграмм на основе данных Doris в панелях мониторинга',
      table: 'Просмотреть статистику',
      table_tip: 'Используется для создания правил оповещения Doris, правил записи, создания индикаторов Polaris и т. д.',
    },
    defaultSearchField: 'Поле поиска по умолчанию',
    default_search_tip_1: 'Установить в качестве поля поиска по умолчанию',
    default_search_tip_2: 'Отменить поле поиска по умолчанию',
    default_search_by_tip: 'Поле поиска по умолчанию',
    interval: 'Интервал',
    interval_tip:
      'Конфигурация интервала запроса будет применяться только при использовании временного макроса $__timeFilter в SQL.<br />Система оповещений ограничит диапазон сканирования данных на основе этого временного окна, чтобы обеспечить своевременность оповещений и производительность базы данных',
    offset: 'Смещение',
    offset_tip:
      'На основе текущего времени запроса сместите указанное количество секунд вперед перед выполнением запроса, аналогично offset в PromQL.<br />Часто используется для обработки задержки записи данных, задержки канала и других сценариев, чтобы избежать ложных срабатываний оповещений из-за несвоевременного поступления данных',
    sql_warning_1:
      'Настоятельно рекомендуется использовать $__timeFilter(поле времени) в условии WHERE для явного ограничения временного диапазона, в противном случае это может привести к таким проблемам, как: <b>аномальная нагрузка на базу данных, тайм-аут запроса оповещения</b>',
    sql_warning_2:
      'SQL использует $__timeGroup, который возвращает данные для нескольких временных точек. В этом сценарии <b>система использует только результаты последней временной точки</b>',
    duration: 'Продолжительность',
    count: 'Количество',
    click_doc: 'Щелкните, чтобы просмотреть документацию по <a>условию запроса</a>',
  },
};
export default ru_RU;
