const ru_RU = {
  quick_query: 'Быстрый запрос',
  quick_query_tip:
    'Быстрый запрос позволяет быстро сгенерировать запрос на основе фиксированного шаблона SQL. Например, если поле A больше 0, достаточно ввести A > 0. Нажав эту кнопку, вы можете быстро переключиться в режим пользовательского запроса, чтобы просмотреть и изменить SQL-запрос.',
  custom_query: 'Пользовательский запрос',
  custom_query_tip: 'Пользовательский запрос позволяет пользователям свободно вводить запросы на основе синтаксиса SQL',
  current_database: 'Текущая база данных',
  table: 'Таблица',
  database_table_required: 'Пожалуйста, выберите базу данных и таблицу',
  query: {
    mode: {
      raw: 'Сырые данные',
      metric: 'Статистический график',
    },
    time_field: 'Поле времени',
    time_field_msg: 'Пожалуйста, введите поле времени',
    sql_msg: 'Пожалуйста, введите SQL-запрос',
    execute: 'Запрос',
    database: 'База данных',
    advancedSettings: {
      title: 'Дополнительные настройки',
      valueKey: 'Поле значения',
      valueKey_tip: 'Результаты SQL-запросов обычно содержат несколько столбцов. Вы можете указать, какие значения столбцов отображаются в виде кривых на графике',
      valueKey_required: 'Поле значения не может быть пустым',
      labelKey: 'Поле метки',
      labelKey_tip: 'Результаты SQL-запросов обычно содержат несколько столбцов. Вы можете указать, какие столбцы используются в качестве метаданных меток для кривых',
    },
  },
};
export default ru_RU;
