const ru_RU = {
  title: 'Каналы уведомлений',
  basic_configuration: 'Базовая конфигурация',
  ident: 'Тип канала',
  ident_tip: 'Классификация каналов уведомлений, например, несколько каналов Dingtalk могут быть установлены с типом dingtalk',
  note_tip: 'Можно добавить дополнительное описание или сценарий использования этого канала уведомлений для удобства будущего обслуживания или совместной работы',
  enable_tip: 'Включить или отключить конфигурацию этого канала уведомлений. После отключения конфигурация временно перестанет работать и уведомления отправляться не будут',
  variable_configuration: {
    title: 'Настройка переменных',
    contact_key: 'Способ связи',
    contact_key_tip:
      'Выберите цель отправки уведомлений, например, "Phone" означает отправку через телефон, SMS и т.д. Вы можете добавить новые способы связи на странице управления контактами',
    params: {
      title: 'Настройка параметров',
      title_tip:
        'Настройте пользовательские параметры, необходимые для этого канала уведомлений (например, токен бота Dingtalk, API Key и т.д.). При настройке канала в правилах уведомлений можно одновременно настроить значения соответствующих пользовательских параметров',
      key: 'Идентификатор параметра',
      key_required: 'Идентификатор параметра не может быть пустым',
      cname: 'Имя параметра',
      cname_required: 'Имя параметра не может быть пустым',
    },
  },
  request_configuration: {
    http: 'Настройка HTTP',
    smtp: 'Настройка SMTP',
    script: 'Настройка скрипта',
    flashduty: 'Настройка FlashDuty',
  },
  request_type: 'Тип отправки',
  http_request_config: {
    title: 'HTTP',
    url: 'URL',
    url_tip: 'Адрес назначения для получения запросов уведомлений',
    method: 'Метод запроса',
    header: 'Заголовки запроса',
    header_tip: 'Пользовательские HTTP-заголовки, которые нужно включить в запрос, такие как информация аутентификации BasicAuth и т.д.',
    header_key: 'Имя параметра',
    header_value: 'Значение параметра',
    timeout: 'Тайм-аут (мс)',
    concurrency: 'Число параллельных запросов',
    concurrency_tip:
      'Максимальное количество параллельных запросов. Увеличение может повысить эффективность отправки, но учитывайте возможности целевого сервиса по обработке запросов',
    retry_times: 'Количество повторных попыток',
    retry_interval: 'Интервал повторных попыток (мс)',
    insecure_skip_verify: 'Пропустить проверку сертификата',
    proxy: 'Прокси',
    proxy_tip: 'Адрес HTTP-прокси для сценариев, требующих прокси',
    params: 'Параметры запроса',
    params_key: 'Имя параметра',
    params_value: 'Значение параметра',
    body: 'Тело запроса',
  },
  smtp_request_config: {
    title: 'SMTP',
    host: 'Сервер',
    host_tip: 'Укажите адрес SMTP-сервера, например smtp.example.com, для отправки электронной почты',
    port: 'Порт',
    port_tip: 'Номер порта SMTP-сервера. Распространенные порты включают 25, 465 (SSL), 587 (STARTTLS). Уточните правильный порт у провайдера',
    username: 'Имя пользователя',
    username_tip: 'Имя пользователя для входа на SMTP-сервер, обычно адрес электронной почты',
    password: 'Пароль',
    password_tip: 'Пароль или код авторизации для соответствующего имени пользователя SMTP. Рекомендуется использовать код авторизации для повышения безопасности',
    from: 'Отправитель',
    from_tip:
      'Имя отправителя или псевдоним электронной почты, отображаемый в письме, позволяющий получателям лучше идентифицировать источник письма. Формат примера: Flashcat <no-reply@notice.flashcat.cloud>',
    insecure_skip_verify: 'Пропустить проверку сертификата',
    insecure_skip_verify_tip: 'Если включено, проверка сертификата SMTP-сервера будет пропущена. Часто используется для тестирования или в средах с самоподписанными сертификатами',
    batch: 'Пакетная отправка',
    batch_tip: 'Сколько писем отправлять за одно SMTP-соединение',
  },
  script_request_config: {
    title: 'Скрипт',
    script: {
      option: 'Использовать скрипт',
      label: 'Содержание скрипта',
    },
    path: {
      option: 'Использовать путь',
      label: 'Путь к файлу',
    },
    timeout: 'Тайм-аут (мс)',
  },
  flashduty_request_config: {
    title: 'FlashDuty',
    integration_url: 'URL',
    integration_url_tip:
      'Здесь указывается адрес интеграции, созданный в центре интеграции Flashduty. Вы можете создать его на https://console.flashcat.cloud/settings/source/alert/add/n9e',
    proxy: 'Прокси',
    proxy_tip: 'Адрес HTTP-прокси для сценариев, требующих прокси',
  },
};

export default ru_RU;
