const ru_RU = {
  title: 'Управление шаблонами уведомлений',
  list: 'Шаблоны уведомлений',
  name: 'Название',
  channel: 'Идентификатор',
  contact_key_name: 'Название способа связи',
  contact_key: 'Идентификатор способа связи',
  hide_channel: 'Скрыть канал',
  hide_contact: 'Скрыть контактную информацию',
  hide: {
    '0': 'Не скрывать',
    '1': 'Скрывать',
  },
  content_prompt: 'Содержимое изменено, хотите отменить изменения?',
  post_title: 'Добавить новый шаблон уведомления',
  update_title: 'Редактировать шаблон уведомления',
};

export default ru_RU;
