const ru_RU = {
  title: 'События Pipelines',
  teams: 'Авторизованные команды',
  teams_tip:
    'Определите, какие члены команды могут просматривать и изменять эту конфигурацию, можно связать несколько команд<br />Например: если конфигурация авторизована для infra-team, то только члены команды infra-team могут получить доступ или изменить эту конфигурацию.',
  basic_configuration: 'Основная конфигурация',
  filter_enable: 'Условия фильтрации',
  label_filters: 'Применимые метки',
  label_filters_tip:
    'Установите условия фильтрации меток для обработки событий. События будут обрабатываться только если они содержат метки, соответствующие этой конфигурации.<br />Пример: введите service=mon, что означает, что событие будет обработано только если оно содержит метку service=mon.',
  attribute_filters: 'Применимые атрибуты',
  attribute_filters_tip:
    'Установите условия фильтрации атрибутов для обработки событий. События будут обрабатываться только если они содержат атрибуты, соответствующие этой конфигурации.<br />Пример: введите Бизнес-группа==DefaultBusiGroup, что означает, что событие будет обработано только если его атрибут "Бизнес-группа" равен DefaultBusiGroup.',
  attribute_filters_value: 'Значение атрибута',
  attribute_filters_options: {
    group_name: 'Бизнес-группа',
    cluster: 'Источник данных',
  },
  processor: {
    title: 'Процессор',
    add_btn: 'Добавить процессор',
    typ: 'Тип',
    help_btn: 'Инструкция по использованию',
  },
  label_enrich: {
    label_source_type: {
      label: 'Источник метки',
      options: {
        built_in_mapping: 'Встроенный словарь меток',
      },
    },
    label_mapping_id: 'Название словаря',
    help: 'Используйте указанные метки в исходных метках для поиска в словаре, добавьте поля, найденные в словаре, в событие тревоги в соответствии с конфигурацией "Новые метки"',
    source_keys: {
      label: 'Исходные метки',
      text: 'Поле <strong>{{field}}</strong> в словаре соответствует метке в событии',
      target_key_placeholder: 'Ключ метки',
      target_key_required: 'Ключ метки не может быть пустым',
    },
    append_keys: {
      label: 'Новые метки',
      source_key_placeholder: 'Поле в словаре',
      rename_key: 'Переименовать ключ метки',
      target_key_placeholder: 'Ключ метки',
    },
  },
  test_modal: {
    title: {
      settings: 'Выберите событие тревоги',
      result: 'Предварительный просмотр события',
    },
  },
  callback: {
    url: 'URL обратного вызова',
    url_placeholder: 'Пожалуйста, введите URL обратного вызова',
    url_required: 'URL обратного вызова не может быть пустым',
    advanced_settings: 'Расширенные настройки',
    basic_auth_user: 'Имя пользователя авторизации',
    basic_auth_user_placeholder: 'Пожалуйста, введите имя пользователя авторизации',
    basic_auth_pass: 'Пароль авторизации',
    basic_auth_pass_placeholder: 'Пожалуйста, введите пароль авторизации',
    headers: 'Заголовки запроса',
    headerKey: 'Ключ',
    headerValue: 'Значение',
    timeout: 'Таймаут',
    insecure_skip_verify: 'Пропустить проверку сертификата',
    proxy: 'Прокси',
  },
};

export default ru_RU;
